app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" ORDER BY release_date
---
  def index
    @movies = Movie.all.order(params[:sort])

INSERT INTO "movies" ("title", "rating", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "gfdgdfgdfgdf"], ["rating", "G"], ["release_date", "2022-07-17 00:00:00"], ["created_at", "2022-07-17 16:40:11.920718"], ["updated_at", "2022-07-17 16:40:11.920718"]]
---
  def create
    #@movie = Movie.create!(params[:movie]) #did not work on rails 5.
    print movie_params
    @movie = Movie.create(movie_params)